api/app/controllers/api/attendees_controller.rb

  def index
    render json: @session.attendees.all
---
SELECT "attendees".* FROM "attendees" WHERE "attendees"."session_id" = $1  [["session_id", 1]]