api/app/controllers/api/items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."session_id" = $1  [["session_id", 1]]
---
  def index
    render json: @session.items.all

INSERT INTO "items" ("label", "foodstuff", "session_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["label", "easdf"], ["foodstuff", "Food"], ["session_id", 1], ["created_at", "2020-06-08 22:35:35.315624"], ["updated_at", "2020-06-08 22:35:35.315624"]]
---
  def create
    item = @session.items.new(item_params)

    if item.save

UPDATE "items" SET "complete" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["complete", false], ["updated_at", "2020-06-08 22:28:28.863343"], ["id", 1]]
---
  def update
    if @item.update(item_params)

SELECT "items".* FROM "items" WHERE "items"."session_id" = $1 AND "items"."id" = $2 LIMIT $3  [["session_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def set_item
    @item = @session.items.find(params[:id])