app/controllers/api/ingredients_controller.rb

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."item_id" = $1  [["item_id", 1]]
---
  def index
    render json: @item.ingredients.all

INSERT INTO "ingredients" ("name", "complete", "assigned", "item_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "easdfasdf"], ["complete", false], ["assigned", ""], ["item_id", 4], ["created_at", "2020-06-08 22:35:35.367866"], ["updated_at", "2020-06-08 22:35:35.367866"]]
---
  def create
    ingredient = @item.ingredients.new(ingredient_params)

    if ingredient.save

UPDATE "ingredients" SET "assigned" = $1, "complete" = $2, "updated_at" = $3 WHERE "ingredients"."id" = $4  [["assigned", "asdfeasdf"], ["complete", true], ["updated_at", "2020-06-08 22:28:28.820042"], ["id", 1]]
---
  def update
    if @ingredient.update(ingredient_params)

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."item_id" = $1 AND "ingredients"."id" = $2 LIMIT $3  [["item_id", 2], ["id", 5], ["LIMIT", 1]]
---
  def set_ingredient
    @ingredient = @item.ingredient.find(params[:id])

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_item
    @item = Item.find(params[:item_id])